In [4]:
a = 'nitin'
a[::-1]
if a==a[::-1]:
 print(f'{a} is a palindrone')
else:
 print(f'{a} is not a palindrone')

nitin is a palindrone

In [6]:
def check_palindrone(word:str):
    if type(word) == str:
        word =word.upper()
        if word == word[::-1]:
            return 'palindrone'
        else:
            return "not a palindrone"
    else:
        return "Invalid data type"

In [9]:
check_palindrone('ronaldo')

'not a palindrone'

In [36]:
def give_fibo(n):
    fibo = [0,1]
    for i in range(n - 2):
        last_num = fibo[-1]
        second_last_num = fibo[-2]
        next_num = last_num + second_last_num
        fibo.append(next_num)
    return fibo

In [37]:
print(give_fibo(20))

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181]

In [40]:
def check_prime(number):
    for i in range(2,number):
        if number % i == 0:
         return "not a Prime number"
         break
        
    else:
         return 'Prime number'

In [41]:
check_prime(3)

'Prime number'

In [54]:
n=5
for i in range(1,n+1):
    print(' '*(n-i)+ i *'* ')

    *
   * *
  * * *
 * * * *
* * * * *

In [64]:
def print_star(n = 5, typ = 'left'):
    if   typ == 'left':
        space =''
    elif typ == 'right':
        space =' '
    elif typ == 'mid':
        space = ' '
    for i in range(1,n+1):     
        print(space*(n-i) + i*'* ')

In [67]:
print_star(10,"left")

*
* *
* * *
* * * *
* * * * *
* * * * * *
* * * * * * *
* * * * * * * *
* * * * * * * * *
* * * * * * * * * *

In [76]:
def sum_of_n_natural_number(n):
        result = 0
        for i in range(1,n+1):
            result +=i
        return result

In [78]:
sum_of_n_natural_number(12)

78

In [79]:
def factorial(n):
        result = 1
        for i in range(1,n+1):
            result *=i
        return result

In [80]:
factorial(8)

40320

In [9]:
def total_sales(*args):
  #unpacking
  result = 0
  for i in args:
    result += i
  return result

In [10]:
total_sales(1,4,7,8,5,5,7,54)

91

In [17]:
sales = [45678,63,456,2,0]
min_element = sales[0]

for i in sales[1:]:
  if i < min_element:
    min_element = i
print(min_element)

0

In [20]:
sales = [45678,63,456,2,0]
max_element = sales[0]

for i in sales[1:]:
  if i > max_element:
    max_element = i
print(max_element)

45678

In [23]:
def maxx(*data):
  maxx_ele = data[0]
  for i in data[1:]:
    if i> maxx_ele:
      maxx_ele = i
  return maxx_ele

In [24]:
maxx(376,246,354,64,667,468)

667

In [28]:
company = ['ola','uber','rapido','indrive','adani','tata']
def add_hashtag(*company):
    result =[]
    for i in company:
        result.append("#"+i.upper())
    return result

In [29]:
add_hashtag(*company)

['#OLA', '#UBER', '#RAPIDO', '#INDRIVE', '#ADANI', '#TATA']

In [50]:
def store_record(name,age,sec,roll_no,Class):
        data = {'Name':name,'Age':age,'Sec':sec,'Roll_NO':roll_no,'Class':Class}
        import pandas as pd
        result = pd.DataFrame(data,index = [1])
        return result

In [52]:
display(store_record('Mohan',21,'A',12,12))
display(store_record('Karan',21,'A',12,12))
display(store_record('Naman',21,'A',12,12))

    Name  Age Sec  Roll_NO  Class
1  Mohan   21   A       12     12

    Name  Age Sec  Roll_NO  Class
1  Karan   21   A       12     12

    Name  Age Sec  Roll_NO  Class
1  Naman   21   A       12     12

In [53]:
def students_records(**kwargs):
    # print(kwargs)
    # try exception
    import pandas as pd
    try:
        result = pd.DataFrame(kwargs)
        return result
    except:
        result = pd.DataFrame(kwargs,index = [1])
        return result

In [54]:
students_records(Name = ['Komal','Mohan','Ajay'],
                 Age = [23,45,56],
                 Roll_No = [23,32,67],
                 Address = ['Noida','Delhi','Greater Noida'])

    Name  Age  Roll_No        Address
0  Komal   23       23          Noida
1  Mohan   45       32          Delhi
2   Ajay   56       67  Greater Noida